# Parameters
nc: 3
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# C3k2 args: [c2, c3k, e, g, shortcut, use_att, reduction, in_shortcut, att_type]
# SPPF  args: [c2, k, reduction]

backbone:
  - [-1, 1, Conv,   [64, 3, 2]]                                           # 0-P1/2
  - [-1, 1, Conv,   [128, 3, 2]]                                          # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]                                    # 2  - no CA
  - [-1, 1, Conv,   [256, 3, 2]]                                          # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]                                    # 4  - no CA
  - [-1, 1, Conv,   [512, 3, 2]]                                          # 5-P4/16
  - [-1, 2, C3k2,  [512,  True, 0.5, 1, False, True, 16, True, "CA"]]    # 6  ✅ CA AvgPool
  - [-1, 1, Conv,   [1024, 3, 2]]                                         # 7-P5/32
  - [-1, 2, C3k2,  [1024, True, 0.5, 1, False, True, 16, True, "CA"]]    # 8  ✅ CA AvgPool
  - [-1, 1, SPPF,  [1024, 5, 16]]                                         # 9  ✅ MaxPool CA
  - [-1, 2, C2PSA, [1024]]                                                # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                            # 11
  - [[-1, 6], 1, Concat, [1]]                                             # 12
  - [-1, 2, C3k2, [512,  False, 0.5, 1, False, True, 16, True, "CA"]]    # 13 ✅ CA AvgPool

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                            # 14
  - [[-1, 4], 1, Concat, [1]]                                             # 15
  - [-1, 2, C3k2, [256,  False, 0.5, 1, False, True, 16, True, "CA"]]    # 16 ✅ CA AvgPool

  - [-1, 1, Conv,  [256, 3, 2]]                                           # 17
  - [[-1, 13], 1, Concat, [1]]                                            # 18
  - [-1, 2, C3k2, [512,  False, 0.5, 1, False, True, 16, True, "CA"]]    # 19 ✅ CA AvgPool

  - [-1, 1, Conv,  [512, 3, 2]]                                           # 20
  - [[-1, 10], 1, Concat, [1]]                                            # 21
  - [-1, 2, C3k2, [1024, True, 0.5, 1, False, True, 16, True, "CA"]]     # 22 ✅ CA AvgPool

  - [[16, 19, 22], 1, Detect, [nc]]                                       # 23