# Ultralytics YOLO11 - Fruit Detection (Persimmon, Apple, Strawberry)
# Modified with Coordinate Attention (CA) on key backbone + head layers
# CA layers: 6 (P4 backbone), 8 (P5 backbone), 13 (P4 head), 16 (P3 head), 19 (P4 head), 22 (P5 head)

# Parameters
nc: 3  # number of classes: persimmon, apple, strawberry
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512]  # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512]  # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512]  # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# C3k2 args (after c1 from prev layer, n from repeats):
#   [c2, c3k, e, g, shortcut, use_att, reduction, useAvgPool, in_shortcut, att_type]

# YOLO11 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]]                                                          # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2]]                                                         # 1-P2/4
  - [-1, 2, C3k2, [256, True, 0.25, 1, False, True, 16, False, True, "CA"]]                                                   # 2  - no CA (low-level, early features)
  - [-1, 1, Conv,  [256, 3, 2]]                                                         # 3-P3/8
  - [-1, 2, C3k2, [512, True, 0.25, 1, False, True, 16, False, True, "CA"]]                                                   # 4  - no CA
  - [-1, 1, Conv,  [512, 3, 2]]                                                         # 5-P4/16
  - [-1, 2, C3k2, [512,  True, 0.5, 1, False, True, 16, False, True, "CA"]]            # 6  ✅ CA - P4: mid-level shape/texture (persimmon calyx, strawberry seeds)
  - [-1, 1, Conv,  [1024, 3, 2]]                                                        # 7-P5/32
  - [-1, 2, C3k2, [1024, True, 0.5, 1, False, True, 16, False, True, "CA"]]            # 8  ✅ CA - P5: high-level semantics (persimmon vs apple shape discrimination)
  - [-1, 1, SPPF, [1024, 5]]                                                            # 9
  - [-1, 2, C2PSA, [1024]]                                                              # 10

# YOLO11 head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                                         # 11
  - [[-1, 6], 1, Concat, [1]]                                                           # 12 - cat backbone P4
  - [-1, 2, C3k2, [512,  False, 0.5, 1, False, True, 16, False, True, "CA"]]           # 13 ✅ CA - P4 fusion: stabilizes merged backbone+neck features

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                                         # 14
  - [[-1, 4], 1, Concat, [1]]                                                           # 15 - cat backbone P3
  - [-1, 2, C3k2, [256,  False, 0.5, 1, False, True, 16, False, True, "CA"]]           # 16 ✅ CA - P3: fine-scale, critical for small fruits + color-edge details

  - [-1, 1, Conv,  [256, 3, 2]]                                                         # 17
  - [[-1, 13], 1, Concat, [1]]                                                          # 18 - cat head P4
  - [-1, 2, C3k2, [512,  False, 0.5, 1, False, True, 16, False, True, "CA"]]           # 19 ✅ CA - P4/16-medium

  - [-1, 1, Conv,  [512, 3, 2]]                                                         # 20
  - [[-1, 10], 1, Concat, [1]]                                                          # 21 - cat head P5
  - [-1, 2, C3k2, [1024, True, 0.5, 1, False, True, 16, False, True, "CA"]]            # 22 ✅ CA - P5/32-large

  - [[16, 19, 22], 1, Detect, [nc]]                                                     # 23 - Detect(P3, P4, P5)
